app/controllers/alcools_controller.rb

SELECT "alcools".* FROM "alcools"
---
  def index
    @alcools = Alcool.all

INSERT INTO "alcools" ("created_at", "name", "quantity", "updated_at") VALUES ('2010-08-11 10:04:28.240869', 'vodka', 50, '2010-08-11 10:04:28.240869')
---
  def create
    @alcool = Alcool.create(params[:alcool])

SELECT "alcools".* FROM "alcools" WHERE ("alcools"."id" = 1) LIMIT 1
UPDATE "alcools" SET "quantity" = 40, "updated_at" = '2010-08-11 10:04:28.380633' WHERE ("alcools"."id" = 1)
---
  def update
    @alcool = Alcool.find(params[:id])

    if params[:increase]
      @alcool.quantity += params[:quantity].to_i
    else
      @alcool.quantity -= params[:quantity].to_i
    end
    @alcool.save